Gius-8/Danyboard_M0/Firmware/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Danyboard M0 (Native USB Port)
# ---------------------------------------
danyboard_m0.name=Danyboard M0
danyboard_m0.vid.0=0x1209
danyboard_m0.pid.0=0x8123
danyboard_m0.vid.1=0x1209
danyboard_m0.pid.1=0x8123
danyboard_m0.vid.2.build.usb_product="Danyboard M0"

danyboard_m0.upload.tool=bossac
danyboard_m0.upload.protocol=sam-ba
danyboard_m0.upload.maximum_size=262144
danyboard_m0.upload.use_1200bps_touch=true
danyboard_m0.upload.wait_for_upload_port=true
danyboard_m0.upload.native_usb=true
danyboard_m0.build.mcu=cortex-m0plus
danyboard_m0.build.f_cpu=48000000L
danyboard_m0.build.usb_product="Danyboard M0"
danyboard_m0.build.usb_manufacturer="Danyboard"
danyboard_m0.build.board=SAMD_ZERO
danyboard_m0.build.core=arduino
danyboard_m0.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
danyboard_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
danyboard_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
danyboard_m0.build.variant=danyboard_m0
danyboard_m0.build.variant_system_lib=
danyboard_m0.build.vid=0x1234
danyboard_m0.build.pid=0x8123
danyboard_m0.bootloader.tool=openocd
danyboard_m0.bootloader.file=zero/samd21_sam_ba.bin